tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "kylef/formulae"
tap "robotsandpencils/made"

# swift development tools
brew "cmake"
brew "cmake-docs"
brew "cmark-gfm"
brew "ninja"
brew "sccache"
brew "kylef/formulae/swiftenv"

brew "autoconf"
brew "automake"
brew "bash-completion"
brew "bat"
brew "git"
brew "github/gh/gh"
brew "pkg-config"
brew "coreutils"
brew "diff-so-fancy"
brew "pyenv"
brew "openssl"
brew "wget"
brew "xcbeautify"
brew "robotsandpencils/made/xcodes"

cask "1password"
cask "balenaetcher" # flash OS images to SD cards & USB drives
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "notion"
cask "xcodes"
